zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm7_COMMON.h
/* GPT - Peripheral instance base addresses */
/** Peripheral GPT1 base address */
#define GPT1_BASE                                (0x446C0000u)
/** Peripheral GPT1 base pointer */
#define GPT1                                     ((GPT_Type *)GPT1_BASE)
/** Peripheral GPT2 base address */
#define GPT2_BASE                                (0x42EC0000u)
/** Peripheral GPT2 base pointer */
#define GPT2                                     ((GPT_Type *)GPT2_BASE)
/** Array initializer of GPT peripheral base addresses */
#define GPT_BASE_ADDRS                           { 0u, GPT1_BASE, GPT2_BASE }
/** Array initializer of GPT peripheral base pointers */
#define GPT_BASE_PTRS                            { (GPT_Type *)0u, GPT1, GPT2 }
/** Interrupt vectors for the GPT peripheral type */
#define GPT_IRQS                                 { NotAvail_IRQn, GPT1_IRQn, GPT2_IRQn }

/* I2S - Peripheral instance base addresses */
/** Peripheral SAI1 base address */
#define SAI1_BASE                                (0x443B0000u)
/** Peripheral SAI1 base pointer */
#define SAI1                                     ((I2S_Type *)SAI1_BASE)
/** Peripheral SAI2 base address */
#define SAI2_BASE                                (0x42BB0000u)
/** Peripheral SAI2 base pointer */
#define SAI2                                     ((I2S_Type *)SAI2_BASE)
/** Peripheral SAI4 base address */
#define SAI4_BASE                                (0x42BD0000u)
/** Peripheral SAI4 base pointer */
#define SAI4                                     ((I2S_Type *)SAI4_BASE)
/** Array initializer of I2S peripheral base addresses */
#define I2S_BASE_ADDRS                           { 0u, SAI1_BASE, SAI2_BASE, 0u, SAI4_BASE }
/** Array initializer of I2S peripheral base pointers */
#define I2S_BASE_PTRS                            { (I2S_Type *)0u, SAI1, SAI2, (I2S_Type *)0u, SAI4 }
/** Interrupt vectors for the I2S peripheral type */
#define I2S_RX_IRQS                              { NotAvail_IRQn, SAI1_IRQn, SAI2_IRQn, NotAvail_IRQn, SAI4_IRQn }
#define I2S_TX_IRQS                              { NotAvail_IRQn, SAI1_IRQn, SAI2_IRQn, NotAvail_IRQn, SAI4_IRQn }

/* I3C - Peripheral instance base addresses */
/** Peripheral I3C1 base address */
#define I3C1_BASE                                (0x44330000u)
/** Peripheral I3C1 base pointer */
#define I3C1                                     ((I3C_Type *)I3C1_BASE)
/** Peripheral I3C2 base address */
#define I3C2_BASE                                (0x42520000u)
/** Peripheral I3C2 base pointer */
#define I3C2                                     ((I3C_Type *)I3C2_BASE)
/** Array initializer of I3C peripheral base addresses */
#define I3C_BASE_ADDRS                           { 0u, I3C1_BASE, I3C2_BASE }
/** Array initializer of I3C peripheral base pointers */
#define I3C_BASE_PTRS                            { (I3C_Type *)0u, I3C1, I3C2 }
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { NotAvail_IRQn, I3C1_IRQn, I3C2_IRQn }

/* IEE - Peripheral instance base addresses */
/** Peripheral IEE base address */
#define IEE_BASE                                 (0x42E40000u)
/** Peripheral IEE base pointer */
#define IEE                                      ((IEE_Type *)IEE_BASE)
/** Array initializer of IEE peripheral base addresses */
#define IEE_BASE_ADDRS                           { IEE_BASE }
/** Array initializer of IEE peripheral base pointers */
#define IEE_BASE_PTRS                            { IEE }

/* IEE_APC - Peripheral instance base addresses */
/** Peripheral IEE_APC base address */
#define IEE_APC_BASE                             (0x42E44000u)
/** Peripheral IEE_APC base pointer */
#define IEE_APC                                  ((IEE_APC_Type *)IEE_APC_BASE)
/** Array initializer of IEE_APC peripheral base addresses */
#define IEE_APC_BASE_ADDRS                       { IEE_APC_BASE }
/** Array initializer of IEE_APC peripheral base pointers */
#define IEE_APC_BASE_PTRS                        { IEE_APC }

/* IERC_IERB - Peripheral instance base addresses */
/** Peripheral IERC_IERB base address */
#define IERC_IERB_BASE                           (0x60810000u)
/** Peripheral IERC_IERB base pointer */
#define IERC_IERB                                ((IERC_IERB_Type *)IERC_IERB_BASE)
/** Array initializer of IERC_IERB peripheral base addresses */
#define IERC_IERB_BASE_ADDRS                     { IERC_IERB_BASE }
/** Array initializer of IERC_IERB peripheral base pointers */
#define IERC_IERB_BASE_PTRS                      { IERC_IERB }

/* IERC_PCI - Peripheral instance base addresses */
/** Peripheral IERC_F0_PCI_HDR_TYPE0 base address */
#define IERC_F0_PCI_HDR_TYPE0_BASE               (0x600F8000u)
/** Peripheral IERC_F0_PCI_HDR_TYPE0 base pointer */
#define IERC_F0_PCI_HDR_TYPE0                    ((IERC_PCI_Type *)IERC_F0_PCI_HDR_TYPE0_BASE)
/** Array initializer of IERC_PCI peripheral base addresses */
#define IERC_PCI_BASE_ADDRS                      { IERC_F0_PCI_HDR_TYPE0_BASE }
/** Array initializer of IERC_PCI peripheral base pointers */
#define IERC_PCI_BASE_PTRS                       { IERC_F0_PCI_HDR_TYPE0 }

/* IOMUXC - Peripheral instance base addresses */
/** Peripheral IOMUXC base address */
#define IOMUXC_BASE                              (0x42A10000u)
/** Peripheral IOMUXC base pointer */
#define IOMUXC                                   ((IOMUXC_Type *)IOMUXC_BASE)
/** Array initializer of IOMUXC peripheral base addresses */
#define IOMUXC_BASE_ADDRS                        { IOMUXC_BASE }
/** Array initializer of IOMUXC peripheral base pointers */
#define IOMUXC_BASE_PTRS                         { IOMUXC }

/* IOMUXC_AON - Peripheral instance base addresses */
/** Peripheral IOMUXC_AON base address */
#define IOMUXC_AON_BASE                          (0x443C0000u)
/** Peripheral IOMUXC_AON base pointer */
#define IOMUXC_AON                               ((IOMUXC_AON_Type *)IOMUXC_AON_BASE)
/** Array initializer of IOMUXC_AON peripheral base addresses */
#define IOMUXC_AON_BASE_ADDRS                    { IOMUXC_AON_BASE }
/** Array initializer of IOMUXC_AON peripheral base pointers */
#define IOMUXC_AON_BASE_PTRS                     { IOMUXC_AON }

