zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm7_COMMON.h
/* PLL - Peripheral instance base addresses */
/** Peripheral AUDIO_PLL base address */
#define AUDIO_PLL_BASE                           (0x44484280u)
/** Peripheral AUDIO_PLL base pointer */
#define AUDIO_PLL                                ((PLL_Type *)AUDIO_PLL_BASE)
/** Peripheral ETHERNET_PLL base address */
#define ETHERNET_PLL_BASE                        (0x44484180u)
/** Peripheral ETHERNET_PLL base pointer */
#define ETHERNET_PLL                             ((PLL_Type *)ETHERNET_PLL_BASE)
/** Array initializer of PLL peripheral base addresses */
#define PLL_BASE_ADDRS                           { AUDIO_PLL_BASE, ETHERNET_PLL_BASE }
/** Array initializer of PLL peripheral base pointers */
#define PLL_BASE_PTRS                            { AUDIO_PLL, ETHERNET_PLL }

/* PWM - Peripheral instance base addresses */
/** Peripheral PWM1 base address */
#define PWM1_BASE                                (0x42650000u)
/** Peripheral PWM1 base pointer */
#define PWM1                                     ((PWM_Type *)PWM1_BASE)
/** Peripheral PWM2 base address */
#define PWM2_BASE                                (0x42660000u)
/** Peripheral PWM2 base pointer */
#define PWM2                                     ((PWM_Type *)PWM2_BASE)
/** Peripheral PWM3 base address */
#define PWM3_BASE                                (0x42670000u)
/** Peripheral PWM3 base pointer */
#define PWM3                                     ((PWM_Type *)PWM3_BASE)
/** Peripheral PWM4 base address */
#define PWM4_BASE                                (0x42680000u)
/** Peripheral PWM4 base pointer */
#define PWM4                                     ((PWM_Type *)PWM4_BASE)
/** Array initializer of PWM peripheral base addresses */
#define PWM_BASE_ADDRS                           { 0u, PWM1_BASE, PWM2_BASE, PWM3_BASE, PWM4_BASE }
/** Array initializer of PWM peripheral base pointers */
#define PWM_BASE_PTRS                            { (PWM_Type *)0u, PWM1, PWM2, PWM3, PWM4 }
/** Interrupt vectors for the PWM peripheral type */
#define PWM_CMP_IRQS                             { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { PWM1_0_IRQn, PWM1_1_IRQn, PWM1_2_IRQn, PWM1_3_IRQn }, { PWM2_0_IRQn, PWM2_1_IRQn, PWM2_2_IRQn, PWM2_3_IRQn }, { PWM3_0_IRQn, PWM3_1_IRQn, PWM3_2_IRQn, PWM3_3_IRQn }, { PWM4_0_IRQn, PWM4_1_IRQn, PWM4_2_IRQn, PWM4_3_IRQn } }
#define PWM_RELOAD_IRQS                          { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { PWM1_0_IRQn, PWM1_1_IRQn, PWM1_2_IRQn, PWM1_3_IRQn }, { PWM2_0_IRQn, PWM2_1_IRQn, PWM2_2_IRQn, PWM2_3_IRQn }, { PWM3_0_IRQn, PWM3_1_IRQn, PWM3_2_IRQn, PWM3_3_IRQn }, { PWM4_0_IRQn, PWM4_1_IRQn, PWM4_2_IRQn, PWM4_3_IRQn } }
#define PWM_CAPTURE_IRQS                         { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { PWM1_0_IRQn, PWM1_1_IRQn, PWM1_2_IRQn, PWM1_3_IRQn }, { PWM2_0_IRQn, PWM2_1_IRQn, PWM2_2_IRQn, PWM2_3_IRQn }, { PWM3_0_IRQn, PWM3_1_IRQn, PWM3_2_IRQn, PWM3_3_IRQn }, { PWM4_0_IRQn, PWM4_1_IRQn, PWM4_2_IRQn, PWM4_3_IRQn } }
#define PWM_FAULT_IRQS                           { NotAvail_IRQn, PWM1_FAULT_IRQn, PWM2_FAULT_IRQn, PWM3_FAULT_IRQn, PWM4_FAULT_IRQn }
#define PWM_RELOAD_ERROR_IRQS                    { NotAvail_IRQn, PWM1_FAULT_IRQn, PWM2_FAULT_IRQn, PWM3_FAULT_IRQn, PWM4_FAULT_IRQn }

/* RGPIO - Peripheral instance base addresses */
/** Peripheral RGPIO1 base address */
#define RGPIO1_BASE                              (0x47400000u)
/** Peripheral RGPIO1 base pointer */
#define RGPIO1                                   ((RGPIO_Type *)RGPIO1_BASE)
/** Peripheral RGPIO2 base address */
#define RGPIO2_BASE                              (0x43810000u)
/** Peripheral RGPIO2 base pointer */
#define RGPIO2                                   ((RGPIO_Type *)RGPIO2_BASE)
/** Peripheral RGPIO3 base address */
#define RGPIO3_BASE                              (0x43820000u)
/** Peripheral RGPIO3 base pointer */
#define RGPIO3                                   ((RGPIO_Type *)RGPIO3_BASE)
/** Peripheral RGPIO4 base address */
#define RGPIO4_BASE                              (0x43830000u)
/** Peripheral RGPIO4 base pointer */
#define RGPIO4                                   ((RGPIO_Type *)RGPIO4_BASE)
/** Peripheral RGPIO5 base address */
#define RGPIO5_BASE                              (0x43840000u)
/** Peripheral RGPIO5 base pointer */
#define RGPIO5                                   ((RGPIO_Type *)RGPIO5_BASE)
/** Peripheral RGPIO6 base address */
#define RGPIO6_BASE                              (0x43850000u)
/** Peripheral RGPIO6 base pointer */
#define RGPIO6                                   ((RGPIO_Type *)RGPIO6_BASE)
/** Array initializer of RGPIO peripheral base addresses */
#define RGPIO_BASE_ADDRS                         { 0u, RGPIO1_BASE, RGPIO2_BASE, RGPIO3_BASE, RGPIO4_BASE, RGPIO5_BASE, RGPIO6_BASE }
/** Array initializer of RGPIO peripheral base pointers */
#define RGPIO_BASE_PTRS                          { (RGPIO_Type *)0u, RGPIO1, RGPIO2, RGPIO3, RGPIO4, RGPIO5, RGPIO6 }
/** Interrupt vectors for the RGPIO peripheral type */
#define RGPIO_CH0_IRQS                           { NotAvail_IRQn, GPIO1_0_IRQn, GPIO2_0_IRQn, GPIO3_0_IRQn, GPIO4_IRQn, GPIO5_IRQn, GPIO6_IRQn }
#define RGPIO_CH1_IRQS                           { NotAvail_IRQn, GPIO1_1_IRQn, GPIO2_1_IRQn, GPIO3_1_IRQn, GPIO4_IRQn, GPIO5_IRQn, GPIO6_IRQn }

/* RTWDOG - Peripheral instance base addresses */
/** Peripheral RTWDOG1 base address */
#define RTWDOG1_BASE                             (0x442D0000u)
/** Peripheral RTWDOG1 base pointer */
#define RTWDOG1                                  ((RTWDOG_Type *)RTWDOG1_BASE)
/** Peripheral RTWDOG2 base address */
#define RTWDOG2_BASE                             (0x442E0000u)
/** Peripheral RTWDOG2 base pointer */
#define RTWDOG2                                  ((RTWDOG_Type *)RTWDOG2_BASE)
/** Peripheral RTWDOG3 base address */
#define RTWDOG3_BASE                             (0x42490000u)
/** Peripheral RTWDOG3 base pointer */
#define RTWDOG3                                  ((RTWDOG_Type *)RTWDOG3_BASE)
/** Peripheral RTWDOG4 base address */
#define RTWDOG4_BASE                             (0x424A0000u)
/** Peripheral RTWDOG4 base pointer */
#define RTWDOG4                                  ((RTWDOG_Type *)RTWDOG4_BASE)
/** Peripheral RTWDOG5 base address */
#define RTWDOG5_BASE                             (0x424B0000u)
/** Peripheral RTWDOG5 base pointer */
#define RTWDOG5                                  ((RTWDOG_Type *)RTWDOG5_BASE)
/** Array initializer of RTWDOG peripheral base addresses */
#define RTWDOG_BASE_ADDRS                        { 0u, RTWDOG1_BASE, RTWDOG2_BASE, RTWDOG3_BASE, RTWDOG4_BASE, RTWDOG5_BASE }
/** Array initializer of RTWDOG peripheral base pointers */
#define RTWDOG_BASE_PTRS                         { (RTWDOG_Type *)0u, RTWDOG1, RTWDOG2, RTWDOG3, RTWDOG4, RTWDOG5 }
/** Interrupt vectors for the RTWDOG peripheral type */
#define RTWDOG_IRQS                              { NotAvail_IRQn, RTWDOG1_IRQn, RTWDOG2_IRQn, RTWDOG3_IRQn, RTWDOG4_IRQn, RTWDOG5_IRQn }
/* Extra definition */
#define RTWDOG_UPDATE_KEY                        (0xD928C520U)
#define RTWDOG_REFRESH_KEY                       (0xB480A602U)


