zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm7_COMMON.h
/* S3MU - Peripheral instance base addresses */
/** Peripheral MU_APPS_S3MUA base address */
#define MU_APPS_S3MUA_BASE                       (0x47520000u)
/** Peripheral MU_APPS_S3MUA base pointer */
#define MU_APPS_S3MUA                            ((S3MU_Type *)MU_APPS_S3MUA_BASE)
/** Peripheral MU_RT_S3MUA base address */
#define MU_RT_S3MUA_BASE                         (0x47540000u)
/** Peripheral MU_RT_S3MUA base pointer */
#define MU_RT_S3MUA                              ((S3MU_Type *)MU_RT_S3MUA_BASE)
/** Array initializer of S3MU peripheral base addresses */
#define S3MU_BASE_ADDRS                          { MU_APPS_S3MUA_BASE, MU_RT_S3MUA_BASE }
/** Array initializer of S3MU peripheral base pointers */
#define S3MU_BASE_PTRS                           { MU_APPS_S3MUA, MU_RT_S3MUA }

/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA1 base address */
#define SEMA1_BASE                               (0x44260000u)
/** Peripheral SEMA1 base pointer */
#define SEMA1                                    ((SEMA42_Type *)SEMA1_BASE)
/** Peripheral SEMA2 base address */
#define SEMA2_BASE                               (0x42450000u)
/** Peripheral SEMA2 base pointer */
#define SEMA2                                    ((SEMA42_Type *)SEMA2_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA1_BASE, SEMA2_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA1, SEMA2 }

/* SEMC - Peripheral instance base addresses */
/** Peripheral SEMC base address */
#define SEMC_BASE                                (0x42910000u)
/** Peripheral SEMC base pointer */
#define SEMC                                     ((SEMC_Type *)SEMC_BASE)
/** Array initializer of SEMC peripheral base addresses */
#define SEMC_BASE_ADDRS                          { SEMC_BASE }
/** Array initializer of SEMC peripheral base pointers */
#define SEMC_BASE_PTRS                           { SEMC }
/** Interrupt vectors for the SEMC peripheral type */
#define SEMC_IRQS                                { SEMC_IRQn }

/* SINC - Peripheral instance base addresses */
/** Peripheral SINC1 base address */
#define SINC1_BASE                               (0x42BF0000u)
/** Peripheral SINC1 base pointer */
#define SINC1                                    ((SINC_Type *)SINC1_BASE)
/** Peripheral SINC2 base address */
#define SINC2_BASE                               (0x42C00000u)
/** Peripheral SINC2 base pointer */
#define SINC2                                    ((SINC_Type *)SINC2_BASE)
/** Peripheral SINC3 base address */
#define SINC3_BASE                               (0x42C10000u)
/** Peripheral SINC3 base pointer */
#define SINC3                                    ((SINC_Type *)SINC3_BASE)
/** Array initializer of SINC peripheral base addresses */
#define SINC_BASE_ADDRS                          { 0u, SINC1_BASE, SINC2_BASE, SINC3_BASE }
/** Array initializer of SINC peripheral base pointers */
#define SINC_BASE_PTRS                           { (SINC_Type *)0u, SINC1, SINC2, SINC3 }
/** Interrupt vectors for the SINC peripheral type */
#define SINC_IRQS                                { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { SINC1_CH0_IRQn, SINC1_CH1_IRQn, SINC1_CH2_IRQn, SINC1_CH3_IRQn }, { SINC2_CH0_IRQn, SINC2_CH1_IRQn, SINC2_CH2_IRQn, SINC2_CH3_IRQn }, { SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn } }

/* SPDIF - Peripheral instance base addresses */
/** Peripheral SPDIF base address */
#define SPDIF_BASE                               (0x42BA0000u)
/** Peripheral SPDIF base pointer */
#define SPDIF                                    ((SPDIF_Type *)SPDIF_BASE)
/** Array initializer of SPDIF peripheral base addresses */
#define SPDIF_BASE_ADDRS                         { SPDIF_BASE }
/** Array initializer of SPDIF peripheral base pointers */
#define SPDIF_BASE_PTRS                          { SPDIF }
/** Interrupt vectors for the SPDIF peripheral type */
#define SPDIF_IRQS                               { SPDIF_IRQn }

/* SRC_GENERAL - Peripheral instance base addresses */
/** Peripheral SRC_GENERAL_REG base address */
#define SRC_GENERAL_REG_BASE                     (0x44460000u)
/** Peripheral SRC_GENERAL_REG base pointer */
#define SRC_GENERAL_REG                          ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE)
/** Array initializer of SRC_GENERAL peripheral base addresses */
#define SRC_GENERAL_BASE_ADDRS                   { SRC_GENERAL_REG_BASE }
/** Array initializer of SRC_GENERAL peripheral base pointers */
#define SRC_GENERAL_BASE_PTRS                    { SRC_GENERAL_REG }

/* SRC_MIF_LN28FDSOI_SPLLRAM - Peripheral instance base addresses */
/** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base address */
#define AON_MIF_LN28FDSOI_SPLLRAM_BASE           (0x44462400u)
/** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base pointer */
#define AON_MIF_LN28FDSOI_SPLLRAM                ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)AON_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base address */
#define WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE        (0x44462C00u)
/** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base pointer */
#define WAKEUP_MIF_LN28FDSOI_SPLLRAM             ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base address */
#define MEGA_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463400u)
/** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base pointer */
#define MEGA_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)MEGA_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base address */
#define NETC_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463C00u)
/** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base pointer */
#define NETC_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)NETC_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base addresses */
#define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_ADDRS     { AON_MIF_LN28FDSOI_SPLLRAM_BASE, WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE, MEGA_MIF_LN28FDSOI_SPLLRAM_BASE, NETC_MIF_LN28FDSOI_SPLLRAM_BASE }
/** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base pointers */
#define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_PTRS      { AON_MIF_LN28FDSOI_SPLLRAM, WAKEUP_MIF_LN28FDSOI_SPLLRAM, MEGA_MIF_LN28FDSOI_SPLLRAM, NETC_MIF_LN28FDSOI_SPLLRAM }

/* SRC_MIF_S28SPREGH - Peripheral instance base addresses */
/** Peripheral AON_MIF_S28SPREGH base address */
#define AON_MIF_S28SPREGH_BASE                   (0x44462000u)
/** Peripheral AON_MIF_S28SPREGH base pointer */
#define AON_MIF_S28SPREGH                        ((SRC_MIF_S28SPREGH_Type *)AON_MIF_S28SPREGH_BASE)
/** Peripheral WAKEUP_MIF_S28SPREGH base address */
#define WAKEUP_MIF_S28SPREGH_BASE                (0x44462800u)
/** Peripheral WAKEUP_MIF_S28SPREGH base pointer */
#define WAKEUP_MIF_S28SPREGH                     ((SRC_MIF_S28SPREGH_Type *)WAKEUP_MIF_S28SPREGH_BASE)
/** Peripheral MEGA_MIF_S28SPREGH base address */
#define MEGA_MIF_S28SPREGH_BASE                  (0x44463000u)
/** Peripheral MEGA_MIF_S28SPREGH base pointer */
#define MEGA_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)MEGA_MIF_S28SPREGH_BASE)
/** Peripheral NETC_MIF_S28SPREGH base address */
#define NETC_MIF_S28SPREGH_BASE                  (0x44463800u)
/** Peripheral NETC_MIF_S28SPREGH base pointer */
#define NETC_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)NETC_MIF_S28SPREGH_BASE)
/** Peripheral CM33PLATFORM_CACHE base address */
#define CM33PLATFORM_CACHE_BASE                  (0x44464000u)
/** Peripheral CM33PLATFORM_CACHE base pointer */
#define CM33PLATFORM_CACHE                       ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_CACHE_BASE)
/** Peripheral CM7PLATFORM_CACHE base address */
#define CM7PLATFORM_CACHE_BASE                   (0x44464800u)
/** Peripheral CM7PLATFORM_CACHE base pointer */
#define CM7PLATFORM_CACHE                        ((SRC_MIF_S28SPREGH_Type *)CM7PLATFORM_CACHE_BASE)
/** Peripheral CM33PLATFORM_TCM base address */
#define CM33PLATFORM_TCM_BASE                    (0x44464400u)
/** Peripheral CM33PLATFORM_TCM base pointer */
#define CM33PLATFORM_TCM                         ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_TCM_BASE)
/** Array initializer of SRC_MIF_S28SPREGH peripheral base addresses */
#define SRC_MIF_S28SPREGH_BASE_ADDRS             { AON_MIF_S28SPREGH_BASE, WAKEUP_MIF_S28SPREGH_BASE, MEGA_MIF_S28SPREGH_BASE, NETC_MIF_S28SPREGH_BASE, CM33PLATFORM_CACHE_BASE, CM7PLATFORM_CACHE_BASE, CM33PLATFORM_TCM_BASE }
/** Array initializer of SRC_MIF_S28SPREGH peripheral base pointers */
#define SRC_MIF_S28SPREGH_BASE_PTRS              { AON_MIF_S28SPREGH, WAKEUP_MIF_S28SPREGH, MEGA_MIF_S28SPREGH, NETC_MIF_S28SPREGH, CM33PLATFORM_CACHE, CM7PLATFORM_CACHE, CM33PLATFORM_TCM }

